app/Controllers/Home.php

    public function login()
	{
		$username = $this->request->getPost('username');
		$password = $this->request->getPost('password');

		if (isset($_SESSION['admin_logged_in'])) {
            return view('/');
		}

		if (!isset($_SESSION['admin_logged_in']) && (empty($username) || empty($password))) {
			$this->notif->message('Data login tidak lengkap', 'danger');
            return view('/');
		}

		if (!isset($_SESSION['admin_logged_in']) && isset($username) && isset($password)) {

			$datauser = ['username' => $username, 'password' => md5($password)];

			$user = $this->moduser->asObject()->where($datauser)->limit(1)->find();
---
SELECT *
FROM `user`
WHERE `username` = 'yolanda@gmail.com'
AND `password` = 'e10adc3949ba59abbe56e057f20f883e'
 LIMIT 1

    public function index()
    {
        if (!isset($_SESSION['admin_logged_in'])) {
			$dataIndex['check'] = "Belum login";
			$this->session->removeTempdata('message');
			return view('/login', $dataIndex);
		} else {
			$dataIndex['check'] = "Sedang login";
		}

        $userModel = new User();
        $data['users'] = $userModel->findAll();

        $pasienModel = new Pasien();
        $data['pasien'] = $pasienModel->findAll();
---
SELECT *
FROM `user`
SELECT *
FROM `pasien`

        ];

        $pasienModel = new Pasien();
        $pasienModel->insert($data);
---
INSERT INTO `pasien` (`nama`, `umur`, `tinggi_badan`, `berat_badan`, `gender`, `aktifitas`, `kalori`, `defisit`, `surplus`, `status`) VALUES ('leo', '19', '171', '64', 'pria', '200, 34', 3317.072, 2817.072, 3817.072, 'Normal (Normal Weight)')