app/Controllers/Home.php

    public function index()
    {
        if (!isset($_SESSION['admin_logged_in'])) {
            $dataIndex['check'] = "Belum login";
            $this->session->removeTempdata('message');
            return view('/login', $dataIndex);
        } else {
            $dataIndex['check'] = "Sedang login";
        }

        $userModel = new User();
        $data['users'] = $userModel->findAll();

        $pasienModel = new Pasien();
        $id = $this->session->get('admin_user_id');
        $data['pasien'] = $pasienModel->where('user_id', $id)->findAll();
---
SELECT *
FROM `user`
SELECT *
FROM `pasien`
WHERE `user_id` = '1'