app/Controllers/Home.php

    public function index()
    {
        $userModel = new User();
        $data['users'] = $userModel->findAll();

        $pasienModel = new Pasien();
        $data['pasien'] = $pasienModel->findAll();
---
SELECT *
FROM `user`
SELECT *
FROM `pasien`