app/Models/Pasien.php

    public function searchData($keyword)
    {
        // Lakukan query pencarian sesuai kebutuhan
        $builder = $this->table($this->table);
        $builder->like('nama', $keyword); // Gantilah nama_kolom dengan nama kolom yang sesuai

        return $builder->get()->getResultArray();
---
SELECT *
FROM `pasien`
WHERE `nama` LIKE '%Yolan%' ESCAPE '!'